/*------------------------------------------------------------------*-
   A.C (v1.00)
  ------------------------------------------------------------------
   Simple switch interface code, with software debounce.

   COPYRIGHT
   ---------
   This code is copyright (c) 2001 by Richard Zhang.
-*------------------------------------------------------------------*/

#include "Main.h"
#include "Port.h"

#include "KBI.h"

// ------ Public variable definitions ------------------------------
bit KBI_G;
// ------ Public variable declarations -----------------------------

// ------ Private variables ----------------------------------------

// ------ Private constants ----------------------------------------

/*------------------------------------------------------------------*-
  KBI_Init()
  Initialisation function for the switch library.
-*------------------------------------------------------------------*/
void KBI_Init(void)
	{	
	KBI_G = 0;
	
	// Set PIN23, PIN24 to low voltage interrupt.
	KBLS1 |= 0x18;
	KBLS0 |= 0x18;
	// Set KBI flag and enable.
	KBIF &= 0xe7;
	KBIE |= 0x18;
	EKB = 1;	
	}

/*-----------------------------------------------------------
	KBI_ISR()
	键盘中断，使芯片从省电模式中唤醒
-----------------------------------------------------------*/
void KBI_ISR(void) interrupt 7
	{
	KBIF &= 0xe7;
	
	KBI_G = 1;
	}

/*------------------------------------------------------------------*-
  ---- END OF FILE -------------------------------------------------
-*------------------------------------------------------------------*/
